; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-7-0)
(:domain BLOCKS)
(:objects A B C D E F G - block)
(:INIT (CLEAR B) (CLEAR F) (ONTABLE A) (ONTABLE G) (ON B E) (ON E D) (ON D C) (ON C A) (ON F G) (HANDEMPTY))
(:goal (AND (ON A C) (ON C E) (ON E G) (ON G B) (ON B D) (ON D F)))
)

; plan
1. (unstack f g)
   deleted: (clear f) (handempty) (on f g)
   added: (holding f) (clear g)
   goals met: 0 of 6
2. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 0 of 6
3. (unstack b e)
   deleted: (clear b) (handempty) (on b e)
   added: (holding b) (clear e)
   goals met: 0 of 6
4. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 0 of 6
5. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 0 of 6
6. (stack g b)
   deleted: (holding g) (clear b)
   added: (clear g) (handempty) (on g b)
   goals met: 1 of 6
7. (unstack e d)
   deleted: (clear e) (handempty) (on e d)
   added: (holding e) (clear d)
   goals met: 1 of 6
8. (stack e g)
   deleted: (holding e) (clear g)
   added: (clear e) (handempty) (on e g)
   goals met: 2 of 6
9. (unstack d c)
   deleted: (clear d) (handempty) (on d c)
   added: (holding d) (clear c)
   goals met: 2 of 6
10. (stack d f)
   deleted: (holding d) (clear f)
   added: (clear d) (handempty) (on d f)
   goals met: 3 of 6
11. (unstack e g)
   deleted: (clear e) (handempty) (on e g)
   added: (holding e) (clear g)
   goals met: 2 of 6
12. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 2 of 6
13. (unstack c a)
   deleted: (clear c) (handempty) (on c a)
   added: (holding c) (clear a)
   goals met: 2 of 6
14. (stack c e)
   deleted: (holding c) (clear e)
   added: (clear c) (handempty) (on c e)
   goals met: 3 of 6
15. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 3 of 6
16. (stack a c)
   deleted: (holding a) (clear c)
   added: (clear a) (handempty) (on a c)
   goals met: 4 of 6
17. (unstack g b)
   deleted: (clear g) (handempty) (on g b)
   added: (holding g) (clear b)
   goals met: 3 of 6
18. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 3 of 6
19. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 3 of 6
20. (stack b d)
   deleted: (holding b) (clear d)
   added: (clear b) (handempty) (on b d)
   goals met: 4 of 6
21. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 4 of 6
22. (stack g b)
   deleted: (holding g) (clear b)
   added: (clear g) (handempty) (on g b)
   goals met: 5 of 6
23. (unstack a c)
   deleted: (clear a) (handempty) (on a c)
   added: (holding a) (clear c)
   goals met: 4 of 6
24. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 4 of 6
25. (unstack c e)
   deleted: (clear c) (handempty) (on c e)
   added: (holding c) (clear e)
   goals met: 3 of 6
26. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 3 of 6
27. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 3 of 6
28. (stack e g)
   deleted: (holding e) (clear g)
   added: (clear e) (handempty) (on e g)
   goals met: 4 of 6
29. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 4 of 6
30. (stack c e)
   deleted: (holding c) (clear e)
   added: (clear c) (handempty) (on c e)
   goals met: 5 of 6
31. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 5 of 6
32. (stack a c)
   deleted: (holding a) (clear c)
   added: (clear a) (handempty) (on a c)
   goals met: 6 of 6
